//
//  ConstantData.swift
//  Ibadat-GP-SDK
//
//  Created by Joy on 31/7/22.
//

import Foundation
import CoreLocation

internal final class ConstantData : NSObject{
     static private let SURA_LIST : [String] =  ["সূরা আল ফাতিহা",
                                 "সূরা আল বাক্বারাহ",
                                 "সূরা আলে ইমরান",
                                 "সূরা আন নিসা",
                                 "সূরা আল মায়িদাহ",
                                 "সূরা আল আন-আম",
                                 "সূরা আল আ’রাফ",
                                 "সূরা আল-আনফাল",
                                 "সূরা আত তাওবাহ",
                                  "সূরা ইউনুস",
                                  "সূরা হুদ",
                                  "সূরা ইউসূফ",
                                  "সূরা রা’দ",
                                  "সূরা ইব্রাহীম",
                                  "সূরা আল-হিজর",
                                  "সূরা আন-নাহল",
                                  "সূরা বনী ইসরাঈল",
                                  "সূরা আল কাহফ",
                                  "সূরা মারইয়াম",
                                  "সূরা ত্ত্বায়া-হা",
                                  "সূরা আল আম্বিয়া",
                                  "সূরা আল হাজ্জ্ব",
                                  "সূরা আল মু’মিনূন",
                                  "সূরা আন-নূর",
                                  "সূরা আল-ফুরকান",
                                  "সূরা আশ-শো’আরা",
                                  "সূরা আন নমল",
                                  "সূরা আল কাসাস",
                                  "সূরা আল আনকাবুত",
                                  "সূরা আর-রূম",
                                  "সূরা লোকমান",
                                  "সূরা আস সেজদাহ",
                                  "সূরা আল আহযাব",
                                  "সূরা সাবা",
                                  "সূরা ফাতির",
                                  "সূরা ইয়াসীন",
                                  "সূরা আস-সাফফাত",
                                  "সূরা ছোয়াদ",
                                  "সূরা আয-যুমার",
                                  "সূরা আল-মু’মিন",
                                  "সূরা হা-মীম সেজদাহ",
                                  "সূরা আশ-শুরা",
                                  "সূরা আয যুখরুফ",
                                  "সূরা আদ দোখান",
                                  "সূরা আল জাসিয়া",
                                  "সূরা আল আহক্বাফ",
                                  "সূরা মুহাম্মদ",
                                  "সূরা আল ফাতহ",
                                  "সূরা আল হুজরাত",
                                  "সূরা ক্বাফ",
                                  "সূরা আয-যারিয়াত",
                                  "সূরা আত্ব তূর",
                                  "সূরা আন-নাজম",
                                  "সূরা আল ক্বামার",
                                  "সূরা আর রহমান",
                                  "সূরা আল ওয়াক্বিয়া",
                                  "সূরা আল হাদীদ",
                                  "সূরা আল মুজাদালাহ",
                                  "সূরা আল হাশর",
                                  "সূরা আল মুমতাহিনা",
                                  "সূরা আছ-ছফ",
                                  "সূরা আল জুমুআহ",
                                  "সূরা আল মুনাফিকুন",
                                  "সূরা আত-তাগাবুন",
                                  "সূরা আত্ব-ত্বালাক্ব",
                                  "সূরা আত-তাহরীম",
                                  "সূরা আল মুলক",
                                  "সূরা আল কলম",
                                  "সূরা আল হাক্বক্বাহ",
                                  "সূরা আল মা’আরিজ",
                                  "সূরা নূহ",
                                  "সূরা আল জিন",
                                  "সূরা মুযযামমিল",
                                  "সূরা আল মুদ্দাসসির",
                                  "সূরা আল ক্বেয়ামাহ",
                                  "সূরা আল ইনসান",
                                  "সূরা আল মুরসালাত",
                                  "সূরা আন-নাবা",
                                  "সূরা আন-নযিআ’ত",
                                  "সূরা আবাসা",
                                  "সূরা আত-তাকভীর",
                                  "সূরা আল ইনফিতার",
                                  "সূরা আত-মুতাফীফ",
                                  "সূরা আল ইনশিক্বাক্ব",
                                  "সূরা আল বুরূজ",
                                  "সূরা আত্ব-তারিক্ব",
                                  "সূরা আল আ’লা",
                                  "সূরা আল গাশিয়াহ",
                                  "সূরা আল ফজর",
                                  "সূরা আল বালাদ",
                                  "সূরা আশ-শামস",
                                  "সূরা আল লায়ল",
                                  "সূরা আদ্ব-দ্বোহা",
                                  "সূরা আল ইনশিরাহ",
                                  "সূরা আত ত্বীন",
                                  "সূরা আল আলাক",
                                  "সূরা আল কদর",
                                  "সূরা আল বাইয়্যিনাহ",
                                  "সূরা আল যিলযাল",
                                 "সূরা আল আদিয়াত",
                                 "সূরা আল কারেয়া",
                                 "সূরা আল তাকাসূর",
                                 "সূরা আল আছর",
                                 "সূরা আল হুমাযাহ",
                                 "সূরা আল ফীল",
                                 "সূরা কোরাইশ",
                                 "সূরা আল মাউন",
                                 "সূরা আল কাওসার",
                                 "সূরা আল কাফিরুন",
                                 "সূরা আন-নছর",
                                 "সূরা আল লাহাব",
                                 "সূরা আল এখলাছ",
                                 "সূরা আল ফালাক্ব",
                                 "সূরা আন-নাস"]
    static private let AYER_COUNT : [String]  = ["7",
                                          "286",
                                          "200",
                                          "176",
                                          "120",
                                          "165",
                                          "206",
                                          "75",
                                          "129",
                                          "109",
                                          "123",
                                          "111",
                                          "43",
                                          "52",
                                          "99",
                                          "128",
                                          "111",
                                          "110",
                                          "98",
                                          "135",
                                          "112",
                                          "78",
                                          "118",
                                          "64",
                                          "77",
                                          "227",
                                          "13",
                                          "88",
                                          "69",
                                          "60",
                                          "34",
                                          "30",
                                          "73",
                                          "54",
                                          "45",
                                          "83",
                                          "182",
                                          "88",
                                          "75",
                                          "85",
                                          "54",
                                          "53",
                                          "89",
                                          "59",
                                          "37",
                                          "35",
                                          "38",
                                          "29",
                                          "18",
                                          "45",
                                          "60",
                                          "49",
                                          "62",
                                          "55",
                                          "78",
                                          "96",
                                          "21",
                                          "22",
                                          "24",
                                          "13",
                                          "14",
                                          "11",
                                          "11",
                                          "18",
                                          "12",
                                          "12",
                                          "30",
                                          "52",
                                          "52",
                                          "44",
                                          "28",
                                          "28",
                                          "20",
                                          "56",
                                          "40",
                                          "31",
                                          "50",
                                          "40",
                                          "46",
                                          "42",
                                          "29",
                                          "19",
                                          "36",
                                          "25",
                                          "22",
                                          "17",
                                          "19",
                                          "26",
                                          "30",
                                          "20",
                                          "15",
                                          "21",
                                          "11",
                                          "8",
                                          "8",
                                          "19",
                                          "5",
                                          "8",
                                          "8",
                                          "11",
                                          "11",
                                          "8",
                                          "3",
                                          "9",
                                          "5",
                                          "4",
                                          "7",
                                          "3",
                                          "6",
                                          "3",
                                          "5",
                                          "4",
                                          "5",
                                          "6"]

    static func getAllSurah()-> [SurahModel]{
        var arr : [SurahModel] = []
        
        if  ConstantData.SURA_LIST.count == ConstantData.AYER_COUNT.count{
            for i in 0..<114{
                let surah = SurahModel(surhaName: ConstantData.SURA_LIST[i], ayetCount: "আয়াত সংখ্যা \(ConstantData.AYER_COUNT[i])টি")
                arr.append(surah)
            }
        }else{
            #if DEBUG
            print("surah and ayet not match")
            #endif
        }
        
        return arr
    }
    
    static func getTasbi()-> [TashbiModel]{
        var arr : [TashbiModel] = []
        
        arr.append(.init(title: "সুবহানআল্লাহ", subTitle: "سُبْحَانَ ٱللَّٰهِ", type: .Bismillahh))
        arr.append(.init(title: "আলহামদুলিল্লাহ্", subTitle: "ٱلْحَمْدُ لِلَّٰه", type: .Alhamdulilla))
        arr.append(.init(title: "বিসমিল্লাহ্", subTitle: "بسم الله", type: .Bismillahh))
        arr.append(.init(title: "আল্লাহু আকবার", subTitle: "الله أكبر", type: .AllahuAkbbar))
        arr.append(.init(title: "আস্তাগফিরুল্লাহ", subTitle: "أستغفر الله", type: .Astagfirullah))
        arr.append(.init(title: "আল্লাহ্", subTitle: "الله", type: .Allah))
        arr.append(.init(title: "লা ইলাহা ইল্লালা", subTitle: "لا إله إلا الله", type: .LaIlaha))
        arr.append(.init(title: "লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ", subTitle: "لا حول ولا قوة إلا بالله", type: .LaHawla))
        
        return arr
    }
    static func getTasbiCount()-> [TashbiModel]{
        var arr : [TashbiModel] = []
        
        arr.append(.init(title: "সুবহানআল্লাহ", subTitle: "\(AppData.shared.SUBAHANALLAH)  বার", type: .SubahanAllah))
        arr.append(.init(title: "আলহামদুলিল্লাহ্", subTitle: "\(AppData.shared.ALHAMDULILLAH) বার", type: .Alhamdulilla))
        arr.append(.init(title: "বিসমিল্লাহ্", subTitle: "\(AppData.shared.BISMILLAH) বার", type: .Bismillahh))
        arr.append(.init(title: "আল্লাহু আকবার", subTitle: "\(AppData.shared.ALLAHU_AKBAR) বার", type: .AllahuAkbbar))
        arr.append(.init(title: "আস্তাগফিরুল্লাহ", subTitle: "\(AppData.shared.ASTAGFIRULLAH) বার", type: .Astagfirullah))
        arr.append(.init(title: "আল্লাহ্", subTitle: "\(AppData.shared.ALLAH) বার", type: .Allah))
        arr.append(.init(title: "লা ইলাহা ইল্লালা", subTitle: "\(AppData.shared.LA_ILAHA_ILLALLAH) বার", type: .LaIlaha))
        arr.append(.init(title: "লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ", subTitle: "\(AppData.shared.LA_HAWALA) বার", type: .LaHawla))
        
        return arr
    }
    
    static let ROJAR_NIYOT_TITLE = "রোজার নিয়ত"
    static let ROJAR_NIYOT_ARABIC = " نويت ان اصوم غدا من شهر رمضان المبارك فرضا لك ياالله فتقبل منى انك انت السميع العليم."
    static let ROJAR_NIYOT_PRONOUNCE = "নাওয়াইতু আন আছুমা গাদাম মিন শাহরি রামাদ্বনাল মুবারাকি ফারদ্বাল্লাকা ইয়া আল্লাহ ফাতাক্বাববাল মিন্নী ইন্নাকা আনতাস সামীয়ু\'ল আ\'লীম।"
    static let ROJAR_NIYOT_BANGLA = "অনুবাদঃ হে আল্লাহ আপনার সন্তুষ্টির জন্য আগামীকাল রমজানের ফরজ রোজা রাখার নিয়ত করছি। আমার তরফ থেকে আপনি তা কবুল করুন। নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞাত।"
    
    static let IFTER_DUA_TITLE = "ইফতারের দোয়া"
    
    static let ROJA_VONGER_KARON_TITLE  = "রোযা ভঙ্গের কারণ"
    static let ROJA_VONGER_KARON_DETAILS  = "যে সব কারনে রোযা ভেঙ্গে যায় এবং একটি রোযার পরিবর্তে একটি রোযা কাজা করা ওয়াজিব হয়ঃ\n\n ১: কানে বা নাকে ঔষুধ দিলে।\n\n২: ইচ্ছাকৃতভাবে মুখভরে বমি করলে বা অল্প বমি আসার পর তা গিলে ফেললে।\n\n৩: কুলি করার সময় অনিচ্ছা বশত কন্ঠনালীতে পানি চলে গেলে।\n\n৪: স্ত্রী বা কোন নারীকে শুধু স্পর্শ প্রভৃতি করার কারনেই বীর্যপাত হয়ে গেলে।\n\n৫: এমন কোন জিনিস খেলে যা খাদ্য নয় যেমন : কাঠ, লোহা, মাটি, কয়লা ইত্যাদি।\n\n৬: বিড়ি সিগারেট বা হুক্কা সেবন করলে।\n\n৭: আগরবাতি প্রভৃতির ধোয়া ইচ্ছাকৃত ভাবে নাকে বা কন্ঠনালীতে পৌছালে।\n\n৮: ভুলে পানাহার করার পর রোযা ভেঙ্গে গেছে মনে করে কোন কিছু পানাহার করলে।\n\n৯: রাত আছে মনে করে সুবহে সাদিকের পরে কিছু খেলে।\n\n১০: ইফতারীর সময়ের পূর্বে সময় হয়ে গেছে মনে করে ইফতারী করলে বা কিছু খেলে।\n\n১১: দুপুরের পরে রোযার নিয়ত করলে।\n\n১২: দাঁত দিয়ে রক্ত বের হলে তা থুথুর চেয়ে পরিমানে যদি বেশি হয় এবং কন্ঠনালীতে চলে যায়।\n\n১৩: কেহ জোর পূর্বক রোযাদারের মুখে কিছু দিলে এবং তা কন্ঠনালীতে চলে গেলে।\n\n১৪: দাঁত কোন খাদ্য টুকরো আটকে ছিল, তা সুবহে সাদেকের পর জিহ্বা অথবা আঙ্গুলি দ্বারা বের করে গিলে ফেললে। ( তবে যদি ছুলা বুটের চেয়ে ছোট হয় এবং মুখের ভিতর হতে বের না করে তাহলে রোযা মাকরুহ হবে ভাঙ্গবে না )\n\n১৫: হস্তমৈথুন করে বীর্যপাত ঘটালে। \n\n১৬: পেশাব বা পায়খানার রাস্তায় ঔষুধ, পানি, তৈল বা ভিজা আঙ্গুল প্রবেশ করালে। অথবা শুকনো আঙ্গুল পুরোটা প্রবেশ করিয়ে পুরোটা বা টিছুটা বের করে আবার প্রবেশ করালে। \n\n১৭: মুখে পান রেখে ঘুমিয়ে গেলে এবং এ অবস্থায় সু্বহে সাদিক হয়ে গেলে। \n\n১৮: নস্যি গ্রহন করলে বা কানে তেল ঢাললে। \n\n১৯: রোযার নিয়ত ব্যতীত রোযা রাখলে। \n\n২০: স্ত্রীর বেহুশ, অচেতন বা ঘুমন্ত অবস্থায় তাঁর সাথে সহবাস করলে স্ত্রীর উপর শুধু কাযা ওয়াজিব হবে। \n\n২১: নফল রোযা রেখে ভেঙ্গে ফেললে।\n\n২২: এক দেশে রোযা শুরু করে অন্যদেশে চলে গেলে সেখানে যদি নিজের দেশের তুলনায় আগে ঈদ হয়ে তাহলে নিজের দেশের হিসাবে যে কয়টা রোযা কম হবে তা কাযা করতে হবে। আর যদি বেড়ে যায় তাহলে সে বেড়ে যাওয়া রোযা রাখতে হবে।"
    static let ROJA_KAJA_DETAILS = "১:   সফর অবস্থায় খুব কষ্ট হলে।\n\n২:  অসুস্হ অবস্থায় ঔষুধ সেবন না করলে প্রাণ নাশের আশংকা হলে।\n\n৩: দুগ্ধ দায়িনী স্ত্রীলোকের নিজের বা দুগ্ধ শিশুর জীবনের ব্যাপারে আশংকা হলে।\n\n৪: বৃদ্ধাবস্থায় রোযা রাখার কারনে মারাত্মক দুর্বল হয়ে জীবনের ব্যাপারে আশংকা হলে।\n\n৫: আল্লাহর রাস্তায় জিহাদের জন্য।\n\n৬: বেহুঁশ বা পাগল হয়ে গেলে।\n\n৭: রোগ বেড়ে যাওয়ার বা নতুন কোন রোগ সৃষ্টি হওয়ার আশংকা হলে । ( তবে তা দ্বীনদার, পরযেগার, অভিজ্ঞ চিকিৎসকের পরামর্শ অনুযায়ী হতে হবে )\n\n৮: গর্ভ অবস্থায় নিজের বা সন্তানের প্রাণ নাশের আশংকা হলে।\n \n৯: এমন পিপাসা বা ক্ষুধা যাতে প্রাণের আশংকা হয়।\n\n ( কেহ যদি অন্যকে দিয়ে কাজ করাতে পারে, বা জীবিকা অর্জনের জন্য অন্য কোন কাজি করার সুযোগ থাকা সত্ত্বেও টাকার লোভে এমন কাজ করল, যার কারনে ক্ষধা বা পিপাসায় আক্রান্ত হল, তাহলে তাঁর রোজা ছাড়ার অনুমতি নাই )"
    static let ROJA_HARAM_DETAILS = "১: ঈদুল ফিতরের দিন\n\n২: ঈদুল আযহার দিন\n\n৩: ১১, ১২ ও ১৩ই জিলহজ্ব অর্থাৎ ঈদুল আযহার পরের তিন দিন, এই মোট ৫ দিন রোযা রাখা হারাম।"
    
    //alert
    static let CANCEL = "বাতিল"
    static let ALERT = "সতর্ক"
    static let SETTINGS = "সেটিংস এ যান"
    static let LOCATION_ALERT_MESSAGE = "সঠিক তথ্যের জন্য অনুগ্রহ করে অবস্থান পরিষেবা সক্ষম করুন৷"
    static let DATE = "তারিখ"
    static let SEHRI_LAST_TIME = "সেহরীর শেষ সময়"
    static let IFTER = "ইফতার"
    static let SOKAL = "সকাল"
    static let VOR = "ভোর"
    static let DUPUR = "দুপুর"
    static let BIKAL = "বিকাল"
    static let SONDHA = "সন্ধ্যা"
    static let RAT = "রাত"
    
    static let RESET_TASHBI_TITLE = "গণনা রিসেট"
    static let RESET_TASHBI_SUBTITLE = "রিসেট সম্পন্ন হলে, মোট/বর্তমান গণনা রিকভার করা সম্ভব না"
    static let RESET_OPTION_1 = "বর্তমান গণনা"
    static let RESET_OPTION_2 = "আপনার মোট গণনা"
    
    //all division
    static let DHAKA = "ঢাকা বিভাগ"
    static let RAJSHAHI = "রাজশাহী বিভাগ"
    static let RANGPUR = "রংপুর বিভাগ"
    static let KHULNA = "খুলনা বিভাগ"
    static let BARISHAL = "বরিশাল বিভাগ"
    static let CHOTTROGRAM = "চট্টগ্রাম বিভাগ"
    static let SYLHET = "সিলেট বিভাগ"
    static let MAYMANGSHING = "ময়মনসিংহ বিভাগ"
    
    //location for all division
    static let DHAKA_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 23.43, longitude: 90.25)
    static let RAJSHAHI_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 25.0, longitude: 89.0)
    static let RANGPUR_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 25.42, longitude: 89.22)
    static let KHULNA_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 22.25, longitude: 89.35)
    static let BARISHAL_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 90.20, longitude: 22.45)
    static let CHOTTROGRAM_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 24.05, longitude: 91.0)
    static let SYLHET_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 24.54, longitude: 91.52)
    static let MAYMANGSHING_LOCATION : CLLocationCoordinate2D = CLLocationCoordinate2D(latitude: 24.54, longitude: 90.24)
    
    //zakat
    static let txt_taka = "টাকা";
    static let txt_calculation = "গণনা";
    static let txt_save = "সংরক্ষণ করুন";
    static let txt_saved = "সংরক্ষিত";
    static let txt_the_amount_of_gold_and_silver = "স্বর্ণ ও রৌপ্য পরিমাণ";
    static let txt_calculation_header = "ইসলামে ৭.৫ ভরি স্বর্ণ কিংবা ৫২.৫ ভরি রুপা অথবা সমপরিমাণ অর্থ এক বছর যাবত গচ্ছিত থাকলে তার বাজার মুল্য অনুযায়ী মোট অর্থের শতকরা ২.৫% যাকাত দেওয়ার বিধান রয়েছেইসলামে ৭.৫ ভরি স্বর্ণ কিংবা ৫২.৫ ভরি রুপা অথবা সমপরিমাণ অর্থ এক বছর যাবত গচ্ছিত থাকলে তার বাজার মুল্য অনুযায়ী মোট অর্থের শতকরা ২.৫% যাকাত দেওয়ার বিধান রয়েছে";
    static let txt_no_information_found = "কোন তথ্য পাওয়া যায় নি";
    static let placeholder_select_country = "দেশ নির্বাচন করুন";
    static let title_start_calculation = "গণনা শুরু করুন";
    static let title_save = "সংরক্ষণ";
    static let txt_jakat_calculator = "যাকাত ক্যালকুলেটর";
    static let txt_save_calculation = "হিসাব সংরক্ষণ";
    static let txt_new_calculation = "নতুন হিসাব";
    static let txt_jakat_description = "ইসলামে ৭.৫ ভরি স্বর্ণ কিংবা ৫২.৫ ভরি রুপা অথবা সমপরিমাণ অর্থ এক বছর যাবত গচ্ছিত থাকলে তার বাজার মুল্য অনুযায়ী মোট অর্থের শতকরা ২.৫% যাকাত দেওয়ার বিধান রয়েছে";
    static let txt_total_asset = "মোট সম্পদ";
    static let txt_jakat_baki = "যাকাত বাকী";
    static let txt_title_total_asset = "চন্দ্র বছরে আপনার দখলে থাকা সমস্ত সম্পদের পরিমান প্রবেশ করুন:"
    static let title_nogod_taka = "নগদ টাকা";
    static let title_bank_nogod_taka = "ব্যাংক অ্যাকাউন্টে নগদ টাকা";
    static let title_ornament_header = "সোনা রূপার পরিমান";
    static let text_gold_amount = "সোনার মান (টাকায়)";
    static let text_silver_amount = "রূপার মান (টাকায়)";
    static let title_investment = "বিনিয়োগ";
    static let text_share_market = "শেয়ার বাজার";
    static let text_other_investment = "অন্যান্য বিনিয়োগ";
    static let title_asset = "সম্পত্তি";
    static let text_house_rent = "বাসা ভাড়া";
    static let title_business = "ব্যবসা";
    static let text_nogod_business = "নগদ ব্যবসা";
    static let text_product = "পণ্য";
    static let title_other = "অন্যান্য";
    static let text_pension = "পেনশন";
    static let text_family_loan = "পারিবারিক ঋণ এবং অন্যান্য";
    static let text_other_capital = "অন্যান্য মূলধন";
    static let title_farming = "কৃষিকাজ";
    static let text_taka_amount = "টাকার পরিমান";
    static let title_lialibility = "দায়";
    static let text_credit_card_payment = "ক্রেডিট কার্ড পেমেন্ট";
    static let text_car_payment = "গাড়ির পেমেন্ট";
    static let text_business_payment = "ব্যবসার পেমেন্ট";
    static let text_family_loan_liability = "ফ্যামিলি ঋণ";
    static let text_other_loan = "অন্যান্য ঋণ";
    static let description_nogod_taka = "আপনার যাবতীয় নগদ টাকা যা আপনার কাছে আছে অথবা ব্যাংকে গচ্ছিত আছে, তার উপর ২.৫ হারে যাকাত প্রযোজ্য হবে। নগদ টাকার পরিমাণটি যদি ১ বছর ধরে ব্যাংকে সুরক্ষিত থাকে তবে শুধুমাত্র সেক্ষেত্রেই যাকাত প্রযোজ্য হবে। মৌলিক প্রয়োজন থেকে উদ্ধৃত্ত টাকা-পয়সা নিসাব পরিমাণ হলে এবং এক বছর স্থায়ী হলে বছর শেষে তার যাকাত আদায় করা ফরয হয়। তদ্রূপ  ব্যাংক ব্যালেন্স, ফিক্সড ডিপোজিট, বন্ড, সার্টিফিকেট ইত্যাদিও নগদ টাকা-পয়সার মতোই। এসবের ওপরও যাকাত ফরয হয়।";
    static let description_gold_amount = "সোনা-রুপার অলংকার সর্বদা বা কালেভদ্রে ব্যবহৃত হোক কিংবা একেবারেই ব্যবহার না করা হোক সর্বাবস্থাতেই তার যাকাত দিতে হবে। যেদিন যাকাত হিসাব করা হবে সেদিনের বাজারদর অনুযায়ী হিসাব করতে হবে এবং তার উপর ২.৫ হারে যাকাত প্রযোজ্য হবে। সাড়ে বায়ান্ন ভরি রুপা তা অলংকার হোক বা অন্য কোন আকৃতিতে হোক তার উপর যাকাত প্রযোজ্য হবে। যেদিন যাকাত হিসাব করা হবে সেদিনের বাজারদর অনুযায়ী হিসাব করতে হবে এবং তার উপর ২.৫ হারেযাকাতপ্রযোজ্যহবে।";
    static let description_investment = "শেয়ার, বৈদেশিক মুদ্রা, প্রাইজবন্ড বা সঞ্চয়পত্রও নগদ টাকার মতই । তাই এগুলোর মূল্য হিসাব সকরে যাকাত দিতে হবে । তবে এগুলো থেকে কেউ সুদপ্রাপ্ত হলে তার পূর্ণটাই সদকা করে দিতে হবে। আপনার ব্যাংকে জমান টাকা, সঞ্চয়পত্র, লাইফ ইনস্যুরেন্স, শেয়ারে বিনয়োগ বা অন্য কোন ব্যাবসায় বিনিয়োগ করলে তার উপর যাকাত হিসাব করতে হবে। যাকাত হিসেবের দিন ওই খাতে ক্যাশ যোগ্য টাকা যাকাত যোগ্য সম্পদ হিসেবে গণ্য হবে। যদি আপনার শেয়ার কেনা থাকে যাকাতের হিসাবের দিন ওই শেয়ারের বিক্রয় মূল্য আপনার যাকাত যোগ্য সম্পদ হিসাবে গণ্য করতে হবে। তেমনি, যদি আপনার ডিপিএস অ্যাকাউন্ট থাকে যাকাতের হিসাবের দিন ওই অ্যাকাউন্ট ভাঙলে যে টাকা পাওয়া যাবে তা আপনার যাকাত যোগ্য সম্পদের সাথে যোগ হবে।";
    static let description_asset = "কারো একাধিক বাড়ি রয়েছে। তার উদ্দেশ্য হল ভাড়া খাটিয়ে টাকা অর্জন। তবে উক্ত বাড়ীগুলোর মূল্যের উপর যাকাত আসবে না। তবে ভাড়া বাবদ অর্জিত টাকার উপর যাকাত আসবে যদি নেসাব পরিমান হয়। অনুরূপভাবে থাকার জন্য নির্মাণকৃত বাড়ির উপরেও যাকাত আসে না। ফসলী জমি, বাড়ি নির্মাণের জন্য ক্রয়কৃত জমি এবং এমনিতে ফেলে রাখা জমির উপর যাকাত ফরজ নয়। তবে এগুলো ব্যবসার উদ্দেশ্যে ক্রয় করলে যাকাত দিতে হবে যদি নেসাব পরিমান হয়।";
    static let description_business = "সব ব্যবসায়ীদের জন্যই যাকাত প্রযোজ্য। যে কোন ধরণের ব্যাবসাই হোক না কেন সকল পন্যের বানিজ্যিক লেন দেনের উপর যাকাত দিতে হবে। মিল, কলকারখানা ও বিভিন্ন ব্যবসায়িক প্রতিষ্ঠানে যে সকল আসবাব রাখা রয়েছে সেগুলোর উপর যাকাত ফরজ নয়। কেননা এ সকল জিনিষ বিক্রি করা হয় না। তবে মেশিন থেকে উৎপন্ন পন্যের উপর যাকাত আসবে। অনুরূপভাবে কারখানায় যে সকল কাঁচামাল বিভিন্ন পর্যায়ে রয়েছে তার উপরও যাকাত আসবে। যেমন গার্মেন্টস এ জামা-কাপড়, সুতা, বোতাম, চেইন ইত্যাদি। কাজেই এগুলোর উপর যাকাত আসবে।";
    static let description_other = "আপনার ঋণ থাকলে তা যাকাত যোগ্য সম্পদ থেকে বাদ যাবে। আপনি অন্যকে ঋণ দিয়ে থাকলে, তা আপনার যাকাত যোগ্য সম্পদের হিসাবে গন্য হবে। তবে যদি কোন ঋণ মন্দ ঋণে (অর্থাৎ টাকা না পাওয়ার সম্ভাবনা থাকে) পরিণত হয় তা যাকাত যোগ্য সম্পদ থেকে বাদ দিতে পারেন। প্রভিদেন্ত ফান্ডের টাকা যাকাত যোগ্য সম্পদের হিসাবে গন্য হবে না। যেহেতু এই টাকা আপনার ইচ্ছামত ইন ক্যাশ করার সুযোগ নেই। তবে এই টাকা গ্রহণ করার পর একবছর পূর্ণ হলে সম্পূর্ণ টাকার উপর যাকাত প্রদান করতে হবে।";
    static let description_farming = "নিসাব পরিমাণ স্বীয় সম্পদ ১ বছর নিজ আয়ত্তাধীন থাকাই যাকাত ওয়াজিব হওয়ার পূর্বশর্ত। তবে কৃষিজাত ফসল, খনিজ সম্পদ ইত্যাদির যাকাত প্রতিবার ফসল তোলার সময়ই দিতে হবে।গৃহপালিত পশুর যাকাত ফরয হওয়ার জন্য ইসলামী শরী‘আত কর্তৃক নির্ধারিত নিছাব সংখ্যক পশুর মালিক হতে হবে। আর তা হল, ছাগল, ভেড়া ও দুম্বা ৪০ টি, গরু ৩০ টি এবং উট ৫ টি। উল্লিখিত সংখ্যা হতে কম হলে তার উপর যাকাত ফরয নয়।";
    static let description_liability = "যদি সরকারের নিকট আপনার কোন কর বকেয়া থাকে তাহলে যেদিন যাকাত হিসাব করা হবে সেদিন মুল সম্পদ থেকে দায় টুকু বাদ দিতে হবে। যদি আপনি কোনও ব্যক্তি বা প্রতিষ্ঠান থেকে কোনও ঋণ গ্রহণ করেন এবং যদি আপনি উপরে বর্ণিত যে কোনও বিভাগ থেকে ইতিমধ্যেই বাদ না করে থাকেন, তাহলে আপনি এখানে আপনার অর্থপ্রদানের হার কমাতে পারেন। গাড়ী, বাড়ি ইত্যাদি যাকাতযোগ্য সম্পদ নয়। সততার সাথে যাকাত প্রদান করুন কারণ যাকাত আপনার সম্পদকে রক্ষা করার একটি উপায়। যদি যাকাত জমাকৃত হয়, তবে তা নিয়মিতভাবে বা সম্পূর্ণরূপে পরিশোধ করতে হবে।";
    
    static let DOWNLOAD_ALERT = "নিশ্চিত করতে ডাউনলোড বাটন ক্লিক করুন­"
    static let DOWNLOAD = "ডাউনলোড"
    static let DOWNLOAD_ERROR = "ডাউনলোড ত্রুটি"
    static let DOWNLOAD_DONE = "ডাউনলোড হয়েছে!"
    static let DOWNLOAD_DONE_MESSAGE = "আপনার ছবি আপনার ফটোতে সংরক্ষণ করা হয়েছে"
    
    static let PHOTO_ACCESS_NEEDS = "ওয়ালপেপার সংরক্ষণের জন্য ফটো লাইব্রেরি অ্যাক্সেস প্রয়োজন"
    
    static let ALARM_WARNING = "আপনি আগের তারিখে অ্যালার্ম সেট করতে পারবেন না"
}
